# ==============================================================
# ■ 문제 요약
#  ​전체 초(sec)를 정수로 입력받아 몫과 나머지 연산(//, %)을 활용해 시, 분, 초로 환산한 뒤, 
# 이를 튜플 형태 (시, 분, 초)로 반환하는 함수 to_hms(sec)를 작성하고 언패킹하여 한 줄로 출력하는 문제입니다.
# ==============================================================
# ■ Algorithm
# 전체 초를 입력받아 시, 분, 초로 변환하는 함수 작성 후 반환값 출력
# ==============================================================

def to_hms(sec):
    """ 초를 시, 분, 초로 변환하는 함수입니다
    Args:
        sec(int): 초
    Returns:
        tuple: (시, 분, 초)
    """
    hours = sec // 3600
    minutes = (sec % 3600) // 60
    seconds = sec % 60
    return hours, minutes, seconds
sec = int(input())

# 반환받은 튜플을 언패킹하여 공백으로 구분해 출력
print(*to_hms(sec))

# ==============================================================
