# ==============================================================
# ■ 문제 요약
# 정해진 3자리 숫자(317)를 맞추는 숫자 야구 게임을 구현하는 문제입니다.
# 입력된 숫자의 자리와 값이 모두 일치하면 스트라이크, 값은 존재하지만 자리가 다르면 볼, 일치하는 숫자가 전혀 없으면 아웃으로 판정합니다.
# 3스트라이크가 되면 시도 횟수를 출력하고 종료합니다.
# ==============================================================
# ■ Algorithm
# 1. 입력받은 3자리 숫자를 각각 차릿수 별로 분리한다
# 2. 각 자릿수를 정답 자릿수와 비교한다
# 3. 자릿수가 정답 자릿수와 동일하게 있을 경우 1 스트라이크
# 4. 동일한 자리에 존재하지는 않지만 in 연산자를 통해 다른 자리에 있는 것이 True라면 1 볼
# 5. 정확히 모든 자릿수가 정답 자릿수에 존재할 경우 '3스트라이크! 정답입니다!' 를 출력한다
# ==============================================================
answer = "317"
cnt = 0

while True:
    
    ball = 0
    strike = 0
    cnt += 1
    num = input()
    
    for i, n in enumerate(num):
        
        if n == answer[i]: # 정확히 정답 자릿수와 일치할 경우
            strike += 1
        elif n in answer: # 자릿수는 다른데 있긴 있을 경우
            ball += 1
            
    if ball == 0 and strike == 0:
        print("아웃!")
    elif strike == 3:
        print("3스트라이크! 정답입니다!")
        print(f"총 {cnt}번 만에 맞추셨습니다!")
        break
    else:
        print(f"{strike}스트라이크 {ball}볼")

# ==============================================================