# ==============================================================
# ■ 문제 요약
# 공백으로 구분된 단어들을 입력받아, 같은 글자 구성을 가진 애너그램(Anagram) 단어끼리 한 그룹으로 묶어 출력하는 문제입니다
# 같은 그룹 내의 단어들은 가나다순(사전순)으로 정렬되어야 하며, 그룹 간의 출력 순서는 그룹의 키(정렬된 문자열) 사전순을 따릅니다
# ==============================================================
# ■ Algorithm
# 1. 입력받은 문자열 리스트 words를 순회한다
# 2. 순회하며 해당 단어의 모든 요소를 가지고 있는 구성(정렬된 키)이 딕셔너리에 있을 경우, 해당 단어를 해당 키의 값 리스트에 추가한다
# 3. 딕셔너리에 없을 경우, 새로 키를 생성하여 리스트 형태로 추가한다
# 4. 순회가 종료된 후, 키 순으로 딕셔너리를 정렬한다
# 5. 출력용 반복문으로 값을 출력한다. 출력할 때 각 원소를 사전순으로 정렬하여 출력한다
# ==============================================================

words = input().split()

result = {}

# words 순회
for word in words:

    key = ''.join(sorted(word))

    # word가 딕셔너리에 없을 경우 추가
    if key not in result:
        result[key] = [word]

    # 있을 경우 리스트 값에 추가
    else:
        result[key].append(word)

# 키 순서로 딕셔너리 정렬
result = dict(sorted(result.items()))

# 출력용 반복문
for values in result.values():
    # 알파벳순으로 원소를 정렬하여 출력
    print(' '.join(sorted(values)))

# ==============================================================