// ==============================================================
// ■ 문제 요약
//  정수 N을 입력받아 N줄에 걸쳐 왼쪽이 정렬된 직각 삼각형 형태의 별(*) 패턴을 출력하는 문제입니다.
// ==============================================================
// ■ Algorithm
// 정수 n을 입력받아 왼쪽 정렬 직각 삼각형 출력
// ==============================================================

import java.util.Scanner;

// 정수 n을 입력받아 왼쪽 정렬 직각 삼각형 출력
public class Main {
    public static void main(String[] args) {
        try (Scanner sc = new Scanner(System.in)) {
            int n = sc.nextInt();
            char star = '*';

            for (int i = 1; i <= n; i++) {
                // '*' * i 연산은 접수값이 나오므로 반복문으로 출력
                for (int j = 1; j <= i; j++) {
                    System.out.print("*");
                }
                System.out.println();
            }
        }
    }
}

// ==============================================================
